In [2]:
import pandas as pd

In [2]:
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

In [9]:
df = pd.DataFrame([record1, record2, record3],
                  index=['school1', 'school2', 'school3'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [10]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [11]:
type(df.loc['school2'])

pandas.core.series.Series

In [12]:
df.loc[:,['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school3  Helen     90

In [13]:
df.drop('school1')

          Name      Class  Score
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [14]:
df['ClassRanking'] = None

In [15]:
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school3  Helen    Biology     90         None

## Missing values

In [34]:
df = pd.read_csv('datasets/class_grades.csv')
df.head(10)

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17      NaN     63.15  48.89
3       7         NaN       NaN    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00
7       7       72.85     86.85    60.00       NaN  56.11
8       8       84.26     93.10    47.50     18.52  50.83
9       7       90.10     97.55    51.25     88.89  63.61

In [6]:
mask=df.isnull()
mask.head(10)

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0   False       False     False    False     False  False
1   False       False     False    False     False  False
2   False       False     False     True     False  False
3   False        True      True    False     False  False
4   False       False     False    False     False  False
5   False       False     False    False     False  False
6   False       False     False    False     False  False
7   False       False     False    False      True  False
8   False       False     False    False     False  False
9   False       False     False    False     False  False

In [7]:
df.dropna().head(10)

    Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0        5       57.14     34.09    64.38     51.48  52.50
1        8       95.05    105.49    67.50     99.07  68.33
4        8       91.32     93.64    95.00    107.41  73.89
5        7       95.00     92.58    93.12     97.78  68.06
6        8       95.05    102.99    56.25     99.07  50.00
8        8       84.26     93.10    47.50     18.52  50.83
9        7       90.10     97.55    51.25     88.89  63.61
10       7       80.44     90.20    75.00     91.48  39.72
12       8       97.16    103.71    72.50     93.52  63.33
13       7       91.28     83.53    81.25     99.81  92.22

In [8]:
df.fillna(0, inplace=True)
df.head(10)

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17     0.00     63.15  48.89
3       7        0.00      0.00    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89
5       7       95.00     92.58    93.12     97.78  68.06
6       8       95.05    102.99    56.25     99.07  50.00
7       7       72.85     86.85    60.00      0.00  56.11
8       8       84.26     93.10    47.50     18.52  50.83
9       7       90.10     97.55    51.25     88.89  63.61

In [16]:
df = pd.read_csv("datasets/log.csv")
df.head(20)

          time    user          video  playback position paused  volume
0   1469974424  cheryl     intro.html                  5  False    10.0
1   1469974454  cheryl     intro.html                  6    NaN     NaN
2   1469974544  cheryl     intro.html                  9    NaN     NaN
3   1469974574  cheryl     intro.html                 10    NaN     NaN
4   1469977514     bob     intro.html                  1    NaN     NaN
5   1469977544     bob     intro.html                  1    NaN     NaN
6   1469977574     bob     intro.html                  1    NaN     NaN
7   1469977604     bob     intro.html                  1    NaN     NaN
8   1469974604  cheryl     intro.html                 11    NaN     NaN
9   1469974694  cheryl     intro.html                 14    NaN     NaN
10  1469974724  cheryl     intro.html                 15    NaN     NaN
11  1469974454     sue  advanced.html                 24    NaN     NaN
12  1469974524     sue  advanced.html                 25    NaN     NaN
13  1469974424     sue  advanced.html                 23  False    10.0
14  1469974554     sue  advanced.html                 26    NaN     NaN
15  1469974624     sue  advanced.html                 27    NaN     NaN
16  1469974654     sue  advanced.html                 28    NaN     5.0
17  1469974724     sue  advanced.html                 29    NaN     NaN
18  1469974484  cheryl     intro.html                  7    NaN     NaN
19  1469974514  cheryl     intro.html                  8    NaN     NaN

In [17]:
df = df.set_index('time')
df = df.sort_index()
df.head(20)

              user          video  playback position paused  volume
time
1469974424  cheryl     intro.html                  5  False    10.0
1469974424     sue  advanced.html                 23  False    10.0
1469974454  cheryl     intro.html                  6    NaN     NaN
1469974454     sue  advanced.html                 24    NaN     NaN
1469974484  cheryl     intro.html                  7    NaN     NaN
1469974514  cheryl     intro.html                  8    NaN     NaN
1469974524     sue  advanced.html                 25    NaN     NaN
1469974544  cheryl     intro.html                  9    NaN     NaN
1469974554     sue  advanced.html                 26    NaN     NaN
1469974574  cheryl     intro.html                 10    NaN     NaN
1469974604  cheryl     intro.html                 11    NaN     NaN
1469974624     sue  advanced.html                 27    NaN     NaN
1469974634  cheryl     intro.html                 12    NaN     NaN
1469974654     sue  advanced.html                 28    NaN     5.0
1469974664  cheryl     intro.html                 13    NaN     NaN
1469974694  cheryl     intro.html                 14    NaN     NaN
1469974724  cheryl     intro.html                 15    NaN     NaN
1469974724     sue  advanced.html                 29    NaN     NaN
1469974754     sue  advanced.html                 30    NaN     NaN
1469974824     sue  advanced.html                 31    NaN     NaN

In [18]:
df = df.fillna(method='ffill')
df.head()

              user          video  playback position  paused  volume
time
1469974424  cheryl     intro.html                  5   False    10.0
1469974424     sue  advanced.html                 23   False    10.0
1469974454  cheryl     intro.html                  6   False    10.0
1469974454     sue  advanced.html                 24   False    10.0
1469974484  cheryl     intro.html                  7   False    10.0

In [19]:
df.replace(to_replace=".*.html$", value="webpage", regex=True)

              user    video  playback position  paused  volume
time
1469974424  cheryl  webpage                  5   False    10.0
1469974424     sue  webpage                 23   False    10.0
1469974454  cheryl  webpage                  6   False    10.0
1469974454     sue  webpage                 24   False    10.0
1469974484  cheryl  webpage                  7   False    10.0
1469974514  cheryl  webpage                  8   False    10.0
1469974524     sue  webpage                 25   False    10.0
1469974544  cheryl  webpage                  9   False    10.0
1469974554     sue  webpage                 26   False    10.0
1469974574  cheryl  webpage                 10   False    10.0
1469974604  cheryl  webpage                 11   False    10.0
1469974624     sue  webpage                 27   False    10.0
1469974634  cheryl  webpage                 12   False    10.0
1469974654     sue  webpage                 28   False     5.0
1469974664  cheryl  webpage                 13   False     5.0
1469974694  cheryl  webpage                 14   False     5.0
1469974724  cheryl  webpage                 15   False     5.0
1469974724     sue  webpage                 29   False     5.0
1469974754     sue  webpage                 30   False     5.0
1469974824     sue  webpage                 31   False     5.0
1469974854     sue  webpage                 32   False     5.0
1469974924     sue  webpage                 33   False     5.0
1469977424     bob  webpage                  1    True    10.0
1469977454     bob  webpage                  1    True    10.0
1469977484     bob  webpage                  1    True    10.0
1469977514     bob  webpage                  1    True    10.0
1469977544     bob  webpage                  1    True    10.0
1469977574     bob  webpage                  1    True    10.0
1469977604     bob  webpage                  1    True    10.0
1469977634     bob  webpage                  1    True    10.0
1469977664     bob  webpage                  1    True    10.0
1469977694     bob  webpage                  1    True    10.0
1469977724     bob  webpage                  1    True    10.0

## Manipulating DataFrame

In [5]:
df=pd.read_csv('datasets/presidents.csv')
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days"
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days"
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days"
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days"

In [6]:
df["First"]=df['President']
df["First"]=df["First"].replace("[ ].*", "", regex=True)
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days",George
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days",John
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days",Thomas
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days",James
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days",James

In [7]:
del(df["First"])
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days"
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days"
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days"
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days"

In [8]:
def splitname (row):
    row['First'] = row['President'].split(" ")[0]
    row['Second'] = row['President'].split(" ")[-1]
    return row
df = df.apply(splitname, axis='columns')
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Second
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days",James,Monroe

In [10]:
del(df['First'])
del(df['Second'])

In [12]:
pattern="(^[\w]*)(?:.* )([\w]*$)"
df["President"].str.extract(pattern).head()

        0           1
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [13]:
pattern="(?P<First>^[\w]*)(?:.* )(?P<Last>[\w]*$)"
names=df["President"].str.extract(pattern).head()
names

    First        Last
0  George  Washington
1    John       Adams
2  Thomas   Jefferson
3   James     Madison
4   James      Monroe

In [14]:
df["First"]=names["First"]
df["Last"]=names["Last"]
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,First,Last
0,1,George Washington,"Feb 22, 1732[a]","57years, 67daysApr 30, 1789","65years, 10daysMar 4, 1797","2years, 285days","Dec 14, 1799","67years, 295days",George,Washington
1,2,John Adams,"Oct 30, 1735[a]","61years, 125daysMar 4, 1797","65years, 125daysMar 4, 1801","25years, 122days","Jul 4, 1826","90years, 247days",John,Adams
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57years, 325daysMar 4, 1801","65years, 325daysMar 4, 1809","17years, 122days","Jul 4, 1826","83years, 82days",Thomas,Jefferson
3,4,James Madison,"Mar 16, 1751[a]","57years, 353daysMar 4, 1809","65years, 353daysMar 4, 1817","19years, 116days","Jun 28, 1836","85years, 104days",James,Madison
4,5,James Monroe,"Apr 28, 1758","58years, 310daysMar 4, 1817","66years, 310daysMar 4, 1825","6years, 122days","Jul 4, 1831","73years, 67days",James,Monroe

In [33]:
df.T['0']

KeyError: '0'

In [15]:
df["Born"]=df["Born"].str.extract("([\w]{3} [\w]{1,2}, [\w]{4})")
df["Born"].head()

0    Feb 22, 1732
1    Oct 30, 1735
2    Apr 13, 1743
3    Mar 16, 1751
4    Apr 28, 1758
Name: Born, dtype: object

In [16]:
df["Born"]=pd.to_datetime(df["Born"])
df["Born"].head()

0   1732-02-22
1   1735-10-30
2   1743-04-13
3   1751-03-16
4   1758-04-28
Name: Born, dtype: datetime64[ns]

## QUIZ 2

In [20]:
import pandas as pd
import math
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [18]:
print(obj2['California'] == None)

False

In [19]:
print(obj3['California'])

True

In [21]:
print(math.isnan(obj2['California']))

True

In [22]:
x = obj2['California']
print(obj2['California'] != x)

True

In [23]:
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)

In [25]:
print(
S.iloc[0:3])

1    Alice
2      Bob
3     Rita
dtype: object

In [26]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [28]:
s2[1]

2

In [29]:
s2.iloc[1]

2

In [30]:
s1.loc[1]

'Alice'